Tekla Open API Reference for Tekla Structures 2025
GraphicsDrawer.DrawLineSegment Method
Overload List
Name | Description
DrawLineSegment(LineSegment, Color)
 Draws a temporary line segment in the currently active rendered view.
DrawLineSegment(Point, Point, Color)
 Draws a temporary line segment in the currently active rendered view.
Top
See Also
Reference
GraphicsDrawer Class
Tekla.Structures.Model.UI Namespace